In [40]:
import numpy as np
import pandas as pd

In [41]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name='area')

In [42]:
area

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

In [43]:
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name='population')

In [44]:
population

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

运算：索引对齐

In [45]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

NaN是python表示没有数据的方法，并且任何数与NaN运算都是NaN

In [46]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [47]:
pd.DataFrame({'area':area,'pop':population})

                 area         pop
Alaska      1723337.0         NaN
California   423967.0  38332521.0
New York          NaN  19651127.0
Texas        695662.0  26448193.0

计算的时候，任何数遇到NaN结果都是NaN，但是可以用对应计算的方法名来解决，通过fill_value=0将NaN处理为0

In [48]:
area+population

Alaska               NaN
California    38756488.0
New York             NaN
Texas         27143855.0
dtype: float64

In [49]:
area.add(population,fill_value=0)

Alaska         1723337.0
California    38756488.0
New York      19651127.0
Texas         27143855.0
dtype: float64

DataFrame索引对齐

In [50]:
rng = np.random.RandomState(42)
a = pd.DataFrame(rng.randint(0,20,(2,2)),columns=list("AB"))

In [60]:
a

    A   B
0   6  19
1  14  10

In [61]:
b = pd.DataFrame(rng.randint(0,10,(3,3)),columns=list("CBA"))

In [62]:
b

   C  B  A
0  7  7  2
1  5  4  1
2  7  5  1

In [63]:
a+b

      A     B   C
0   8.0  26.0 NaN
1  15.0  14.0 NaN
2   NaN   NaN NaN

In [64]:
a.add(b)

      A     B   C
0   8.0  26.0 NaN
1  15.0  14.0 NaN
2   NaN   NaN NaN

In [66]:
a.add(b,fill_value=0)

      A     B    C
0   8.0  26.0  7.0
1  15.0  14.0  5.0
2   1.0   5.0  7.0

In [69]:
fill = a.stack().mean() # a的所有值的均值
a.add(b,fill_value=fill)

       A      B      C
0   8.00  26.00  19.25
1  15.00  14.00  17.25
2  13.25  17.25  19.25

|Python运算符|Pandas方法|
|---|---|
|+ |add()|
|- |sub()、subtract()|
|* |mul()、multiply()|
|/ |truediv()、div()、divide() // floordiv()|
|% |mod()|
|** |pow()|